#+TITLE: Negation experiment
#+PROPERTY: header-args:R :session *R* :colnames yes :noweb yes

** Selection Table

#+BEGIN_SRC R 
  cond_lookup <- data_frame(Cond=c("CG", "PG", "NG"),
                            Condition=c("Common Ground",
                                "Privileged Ground",
                                "Control"))

  obsel_lookup <- data_frame(ObjSel=c("unme", "comp", "negt"),
                             Alternative=c("Unnamed",
                                 "Critical",
                                 "Negated"))

  inner_join(obsdat, cond_lookup) %>%
      inner_join(obsel_lookup) %>%
      group_by(Condition, Alternative) %>%
      summarize(Y=n()) %>%
      inner_join(obsdat %>% inner_join(cond_lookup) %>%
                     inner_join(obsel_lookup) %>%
                     group_by(Condition) %>%
                     summarize(N=n())) %>%
      mutate(p=round(Y/N, 3))
#+END_SRC

#+RESULTS:
| Condition         | Alternative |   Y |   N |     p |
|-------------------+-------------+-----+-----+-------|
| Common Ground     | Critical    |  23 | 144 |  0.16 |
| Common Ground     | Negated     |   5 | 144 | 0.035 |
| Common Ground     | Unnamed     | 116 | 144 | 0.806 |
| Control           | Critical    |  71 | 144 | 0.493 |
| Control           | Negated     |   1 | 144 | 0.007 |
| Control           | Unnamed     |  72 | 144 |   0.5 |
| Privileged Ground | Critical    |  62 | 144 | 0.431 |
| Privileged Ground | Negated     |   1 | 144 | 0.007 |
| Privileged Ground | Unnamed     |  81 | 144 | 0.562 |

** Analysis

#+BEGIN_SRC R :exports results :results output
  library(lme4)

  obsdat.glmer <-
      glmer(CritSel ~ PG + CG + (PG + CG | SubjID) + (PG + CG | ItemID),
            data=obsdat, family=binomial(link=logit),
            control=glmerControl(optimizer="bobyqa"))

  obsdat.glmer.noME <-
      glmer(CritSel ~ (PG + CG | SubjID) + (PG + CG | ItemID),
           data=obsdat, family=binomial(link=logit),
           control=glmerControl(optimizer="bobyqa"))

  obsdat.glmer.noCG <-
      glmer(CritSel ~ PG + (PG + CG | SubjID) + (PG + CG | ItemID),
            data=obsdat, family=binomial(link=logit),
            control=glmerControl(optimizer="bobyqa"))

  obsdat.glmer.noPG <-
      glmer(CritSel ~ CG + (PG + CG | SubjID) + (PG + CG | ItemID),
            data=obsdat, family=binomial(link=logit),
            control=glmerControl(optimizer="bobyqa"))

  summary(obsdat.glmer)
  anova(obsdat.glmer, obsdat.glmer.noME)
  anova(obsdat.glmer.noCG, obsdat.glmer)
  anova(obsdat.glmer.noPG, obsdat.glmer)
#+END_SRC

#+RESULTS:
#+begin_example
Generalized linear mixed model fit by maximum likelihood (Laplace
  Approximation) [glmerMod]
 Family: binomial  ( logit )
Formula: CritSel ~ PG + CG + (PG + CG | SubjID) + (PG + CG | ItemID)
   Data: obsdat
Control: glmerControl(optimizer = "bobyqa")

     AIC      BIC   logLik deviance df.resid 
   500.3    561.3   -235.1    470.3      417 

Scaled residuals: 
    Min      1Q  Median      3Q     Max 
-3.0824 -0.7806  0.1722  0.7048  1.8857 

Random effects:
 Groups Name        Variance Std.Dev. Corr       
 SubjID (Intercept) 1.79640  1.3403              
        PG          3.12522  1.7678   0.94       
        CG          8.40399  2.8990   0.95  0.78 
 ItemID (Intercept) 0.04004  0.2001              
        PG          0.02442  0.1563   -1.00      
        CG          0.31455  0.5609   -1.00  1.00
Number of obs: 432, groups:  SubjID, 24; ItemID, 18

Fixed effects:
            Estimate Std. Error z value Pr(>|z|)   
(Intercept)   1.0564     0.3734   2.829  0.00467 **
PG            0.3040     0.4582   0.664  0.50703   
CG            2.8627     0.9323   3.070  0.00214 **
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Correlation of Fixed Effects:
   (Intr) PG   
PG 0.578       
CG 0.853  0.480
Data: obsdat
Models:
obsdat.glmer.noME: CritSel ~ (PG + CG | SubjID) + (PG + CG | ItemID)
obsdat.glmer: CritSel ~ PG + CG + (PG + CG | SubjID) + (PG + CG | ItemID)
                  Df    AIC    BIC  logLik deviance  Chisq Chi Df Pr(>Chisq)
obsdat.glmer.noME 13 514.05 566.94 -244.03   488.05                         
obsdat.glmer      15 500.26 561.28 -235.13   470.26 17.798      2  0.0001365
                     
obsdat.glmer.noME    
obsdat.glmer      ***
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1
Data: obsdat
Models:
obsdat.glmer.noCG: CritSel ~ PG + (PG + CG | SubjID) + (PG + CG | ItemID)
obsdat.glmer: CritSel ~ PG + CG + (PG + CG | SubjID) + (PG + CG | ItemID)
                  Df    AIC    BIC  logLik deviance  Chisq Chi Df Pr(>Chisq)
obsdat.glmer.noCG 14 511.63 568.59 -241.81   483.63                         
obsdat.glmer      15 500.26 561.28 -235.13   470.26 13.375      1  0.0002551
                     
obsdat.glmer.noCG    
obsdat.glmer      ***
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1
Data: obsdat
Models:
obsdat.glmer.noPG: CritSel ~ CG + (PG + CG | SubjID) + (PG + CG | ItemID)
obsdat.glmer: CritSel ~ PG + CG + (PG + CG | SubjID) + (PG + CG | ItemID)
                  Df    AIC    BIC  logLik deviance  Chisq Chi Df Pr(>Chisq)
obsdat.glmer.noPG 14 498.69 555.65 -235.34   470.69                         
obsdat.glmer      15 500.26 561.28 -235.13   470.26 0.4333      1     0.5104
#+end_example

*** View Results

#+BEGIN_SRC R 
  library(dplyr) 

  crg1 <- readRDS("result/cluster_random_grounded_vs_ungrounded_by_subject.rds") %>%
      mutate(analysis="subject")
  crg2 <- readRDS("result/cluster_random_grounded_vs_ungrounded_by_subject.rds") %>%
      mutate(analysis="item")
  crg <- rbind(crg1, crg2)
  crg$from <- (crg$t0 - 1) * 50
  crg$to <- (crg$t1 - 1) * 50
  print(select(crg, analysis, csum, p, from, to))
#+END_SRC

#+RESULTS:
|              csum |      p | from |   to |
|-------------------+--------+------+------|
| -4.67349865978301 |  0.253 |  150 |  200 |
|   20.173972423547 | 0.0439 |  950 | 1250 |
|  6.61669880567997 | 0.2024 | 2100 | 2200 |


*** View Results

#+BEGIN_SRC R 
  library(dplyr) 

  crc1 <- readRDS("result/cluster_random_common_vs_privileged_by_subject.rds") %>%
      mutate(analysis="subject")
  crc2 <- readRDS("result/cluster_random_common_vs_privileged_by_item.rds") %>%
      mutate(analysis="item")
  crc <- rbind(crc1, crc2)

  crc$from <- (crc$t0 - 1) * 50
  crc$to <- (crc$t1 - 1) * 50
  print(select(crc, analysis, csum, p, from, to))
#+END_SRC

#+RESULTS:
| analysis |             csum |    p | from |   to |
|----------+------------------+------+------+------|
| subject  | 58.2508101863728 | 0.02 | 1600 | 2500 |
| item     | 83.3733108891259 | 0.01 | 1600 | 2500 |

